compukidmike/Saintcon2025/Firmware/badge/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOOTLOADER_FLASH_DC_AWARE=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_I2C_MANAGER_BUS_A_SDA_GPIO=10
CONFIG_I2C_MANAGER_BUS_A_SCL_GPIO=9
CONFIG_I2C_MANAGER_BUS_B_ENABLE=y
CONFIG_I2C_MANAGER_BUS_B_SDA_GPIO=7
CONFIG_I2C_MANAGER_BUS_B_SCL_GPIO=15
CONFIG_LED_GPIO=3
CONFIG_LED_GAMMA_CORRECTION=n
CONFIG_SECURE_ELEMENT_ENABLED=y
CONFIG_CONFERENCE_WIFI_SSID="LlamaNet-OutOfScope"
CONFIG_CONFERENCE_WIFI_PASSWORD="HiTherePlum!"
CONFIG_BATTERY_SENSE_GPIO=1
CONFIG_AI_INHIBITOR_GPIO=5
CONFIG_AI_SECURITY_STRIP_GPIO=4
CONFIG_LCD_I80_DATA_0_GPIO=35
CONFIG_LCD_I80_DATA_1_GPIO=48
CONFIG_LCD_I80_DATA_2_GPIO=47
CONFIG_LCD_I80_DATA_3_GPIO=21
CONFIG_LCD_I80_DATA_4_GPIO=14
CONFIG_LCD_I80_DATA_5_GPIO=13
CONFIG_LCD_I80_DATA_6_GPIO=12
CONFIG_LCD_I80_DATA_7_GPIO=11
CONFIG_LCD_I80_RS_GPIO=38
CONFIG_LCD_I80_CS_GPIO=39
CONFIG_LCD_I80_RD_GPIO=36
CONFIG_LCD_I80_WR_GPIO=37
CONFIG_LCD_I80_RESET_GPIO=40
CONFIG_LCD_ORIENTATION_PORTRAIT=y
CONFIG_LCD_BACKLIGHT_CONTROL_PWM=y
CONFIG_LCD_BACKLIGHT_GPIO=18
CONFIG_LCD_I80_COLOR_IN_PSRAM=y
CONFIG_LCD_SWAP_COLOR_BYTES=y
CONFIG_INPUT_JOYSTICK_ENABLED=y
CONFIG_INPUT_JOY_UP_GPIO=41
CONFIG_INPUT_JOY_DOWN_GPIO=43
CONFIG_INPUT_JOY_LEFT_GPIO=2
CONFIG_INPUT_JOY_RIGHT_GPIO=42
CONFIG_INPUT_JOY_CENTER_GPIO=44
CONFIG_MINIBADGE_ENABLED=y
CONFIG_MINIBADGE_CLOCK_LOW_PIN=16
CONFIG_MINIBADGE_CLOCK_HIGH_PIN=17
CONFIG_NFC_GPO_PIN=6
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_RMT_RECV_FUNC_IN_IRAM=y
CONFIG_ETH_USE_SPI_ETHERNET=n
CONFIG_ESP_SYSTEM_GDBSTUB_RUNTIME=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_120M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
CONFIG_LOG_COLORS=y
CONFIG_LWIP_IP4_REASSEMBLY=y
CONFIG_LWIP_IP6_REASSEMBLY=y
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4
CONFIG_LWIP_SNTP_MAX_SERVERS=3
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_3=y
CONFIG_MBEDTLS_GCM_SUPPORT_NON_AES_CIPHER=n
CONFIG_MBEDTLS_ECP_FIXED_POINT_OPTIM=y
CONFIG_SPI_FLASH_HPM_ENA=y
CONFIG_ATECC608A_TCUSTOM=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_USE_VECTOR_GRAPHIC=y
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_USE_ASSERT_STYLE=y
CONFIG_LV_OBJ_STYLE_CACHE=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FS_DEFAULT_DRIVER_LETTER=83
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=83
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=80
CONFIG_LV_USE_LODEPNG=y
CONFIG_LV_BIN_DECODER_RAM_LOAD=y
CONFIG_LV_USE_SVG=y
CONFIG_LV_USE_SNAPSHOT=y
CONFIG_LV_USE_ST7789=y
